constant/Kiesdistribution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    object      kinematicCloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(
(-0.03942480 -1.59527004 -0.15154700)
(-0.27126801 -1.56923997 -0.15336700)
(-0.12904400 -1.56659997 -0.16052200)
(-0.00355886 -1.56681001 -0.16057900)
(-0.31669399 -1.55967999 -0.16059500)
(-0.35261700 -1.53957999 -0.16053900)
(-0.28433600 -1.54558003 -0.16057099)
(-0.20680299 -1.54496002 -0.16055900)
(-0.15048601 -1.54745996 -0.15873300)
(-0.08094640 -1.54611003 -0.16057400)
(-0.04005890 -1.54676998 -0.16055200)
(-0.32509401 -1.53296995 -0.16055800)
(-0.25238001 -1.52921999 -0.16055299)
(-0.44687399 -1.51033998 -0.16057000)
(-0.41891700 -1.51012003 -0.16055200)
(-0.39044300 -1.51956999 -0.16058899)
(-0.21850000 -1.51891994 -0.16052499)
(-0.14790900 -1.51741004 -0.16057400)
(-0.07900510 -1.51382995 -0.16058800)
(-0.03206120 -1.50822997 -0.16052601)
(-0.00397642 -1.51003003 -0.16052499)
(-0.50465101 -1.50136006 -0.15264200)
(-0.28525800 -1.50506997 -0.15309300)
(-0.54592800 -1.48525000 -0.16057400)
(-0.39724699 -1.49242997 -0.16055299)
(-0.15901300 -1.49258006 -0.15408801)
(-0.03782130 -1.47948003 -0.16055501)
(-0.33936799 -1.47457004 -0.16059899)
(-0.19837900 -1.47007000 -0.16052499)
(-0.55864298 -1.46035004 -0.16055299)
(-0.57705402 -1.43880999 -0.16052200)
(-0.52923298 -1.44980001 -0.16052701)
(-0.36828601 -1.44571996 -0.16057500)
(-0.12374400 -1.44237995 -0.15396599)
(-0.09707980 -1.44928002 -0.16055000)
(-0.04506060 -1.43687999 -0.15217599)
(-0.00180801 -1.44459999 -0.16054299)
(-0.48973900 -1.42550004 -0.15196100)
(-0.34323701 -1.43324995 -0.16057999)
(-0.07402920 -1.43340003 -0.16053399)
(-0.57985097 -1.41138995 -0.15553699)
(-0.55235600 -1.41659999 -0.15498900)
(-0.52548897 -1.42202997 -0.16057500)
(-0.26107499 -1.41929996 -0.15461600)
(-0.18712400 -1.40932000 -0.16054501)
(-0.09195860 -1.41171002 -0.15684500)
(-0.05489290 -1.41206002 -0.16057999)
(-0.00769391 -1.41657996 -0.16057301)
(-0.49548301 -1.39952004 -0.16055600)
(-0.33246201 -1.40724003 -0.16057600)
(-0.70743400 -1.38050997 -0.16056800)
(-0.46850500 -1.39198005 -0.16052200)
(-0.04359480 -1.37110996 -0.16054100)
(-0.75583202 -1.35177004 -0.16057800)
(-0.69625902 -1.33359003 -0.15404700)
(-0.66835302 -1.33378994 -0.15218399)
(-1.05324996 -1.06225002 -0.16058899)
(-1.18642998 -0.93612999 -0.15426300)
(-1.24188006 -0.82872897 -0.16053800)
(-1.21773005 -0.81453103 -0.16056900)
(-1.23881996 -0.79597300 -0.16057301)
(-1.18008006 -0.75638002 -0.15249200)
(-1.29434001 -0.72373998 -0.15614200)
(-1.23044002 -0.72903502 -0.16061901)
(-1.27666998 -0.70264697 -0.16056500)
(-1.21557999 -0.69030499 -0.15878500)
(-1.24239004 -0.68662101 -0.15143199)
(-1.28487003 -0.67575002 -0.16055401)
(-1.29749000 -0.64893597 -0.16055700)
(-1.28723001 -0.62234402 -0.16054700)
(-1.33313000 -0.61501300 -0.16055800)
(-1.23839998 -0.60922098 -0.16052200)
(-1.30771005 -0.60330302 -0.16059200)
(-1.28092003 -0.59507501 -0.16056800)
(-1.30323005 -0.57269597 -0.16055100)
(-1.35558999 -0.53844398 -0.16055501)
(-1.32086003 -0.54714203 -0.16057400)
(-1.33304000 -0.52193803 -0.16052601)
(-1.25712001 -0.52399498 -0.16055501)
(-1.35204995 -0.50001597 -0.16057099)
(-1.32457995 -0.49531701 -0.15814900)
(-1.26841998 -0.47907299 -0.16055501)
(-1.36868000 -0.47613001 -0.16058500)
(-1.34098005 -0.47277600 -0.16058600)
(-1.23799002 -0.47861800 -0.16053700)
(-1.31443000 -0.46417701 -0.16054501)
(-1.35676003 -0.44247901 -0.16056401)
(-1.33390999 -0.42474100 -0.15234600)
(-1.30637002 -0.43287501 -0.16054399)
(-1.37990999 -0.41789401 -0.15286900)
(-1.35487998 -0.40820399 -0.16057301)
(-1.30062997 -0.39763501 -0.15604199)
(-1.36187005 -0.38113499 -0.16057099)
(-1.32913005 -0.38907400 -0.16055600)
(-1.30539000 -0.37047401 -0.16060001)
(-1.27933002 -0.37961799 -0.15402301)
(-1.37002003 -0.35402501 -0.16053601)
(-1.28376997 -0.35255101 -0.16054900)
(-1.34250998 -0.34891200 -0.16054600)
...
)
