system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Do a synchronisation of coupled points after creation of any patches.
// Note: this does not work with points that are on multiple coupled patches
//       with transformations (i.e. cyclics).
pointSync false;

// Patches to create.
patches
(
    {
        //- Master side patch
        name            fluidToSchaufelSideAMI;
        patchInfo
        {
            type            cyclicAMI;
            matchTolerance  0.001;
            neighbourPatch  schaufelToFluidSideAMI;
            transform       noOrdering;
            lowWeightCorrection 0.2;
        }
        constructFrom patches;
        patches (fluidToSchaufelSide_ami);
    }

    {
        //- Slave side patch
        name            schaufelToFluidSideAMI;
        patchInfo
        {
            type            cyclicAMI;
            matchTolerance  0.001;
            neighbourPatch  fluidToSchaufelSideAMI;
            transform       noOrdering;
            lowWeightCorrection 0.2;
        }
        constructFrom patches;
        patches (schaufelToFluidSide_ami);
    }

    {
        //- Master side patch
        name            fluidToSchaufelTopAMI;
        patchInfo
        {
            type            cyclicAMI;
            matchTolerance  0.001;
            neighbourPatch  schaufelToFluidTopAMI;
            transform       noOrdering;
            lowWeightCorrection 0.2;
        }
        constructFrom patches;
        patches (fluidToSchaufelTop_ami);
    }

    {
        //- Slave side patch
        name            schaufelToFluidTopAMI;
        patchInfo
        {
            type            cyclicAMI;
            matchTolerance  0.001;
            neighbourPatch  fluidToSchaufelTopAMI;
            transform       noOrdering;
            lowWeightCorrection 0.2;
        }
        constructFrom patches;
        patches (schaufelToFluidTop_ami);
    }

    {
        //- Master side patch
        name            fluidToSchaufelBottomAMI;
        patchInfo
        {
            type            cyclicAMI;
            matchTolerance  0.001;
            neighbourPatch  schaufelToFluidBottomAMI;
            transform       noOrdering;
            lowWeightCorrection 0.2;
        }
        constructFrom patches;
        patches (fluidToSchaufelBottom_ami);
    }

    {
        //- Slave side patch
        name            schaufelToFluidBottomAMI;
        patchInfo
        {
            type            cyclicAMI;
            matchTolerance  0.001;
            neighbourPatch  fluidToSchaufelBottomAMI;
            transform       noOrdering;
            lowWeightCorrection 0.2;
        }
        constructFrom patches;
        patches (schaufelToFluidBottom_ami);
    }

    {
        //- Master side patch
        name            fluidToWirblerAMI;
        patchInfo
        {
            type            cyclicAMI;
            matchTolerance  0.001;
            neighbourPatch  wirblerToFluidAMI;
            transform       noOrdering;
            lowWeightCorrection 0.2;
        }
        constructFrom patches;
        patches (fluidToWirbler_ami);
    }

    {
        //- Slave side patch
        name            wirblerToFluidAMI;
        patchInfo
        {
            type            cyclicAMI;
            matchTolerance  0.001;
            neighbourPatch  fluidToWirblerAMI;
            transform       noOrdering;
            lowWeightCorrection 0.2;
        }
        constructFrom patches;
        patches (wirblerToFluid_ami);
    }

);

// ************************************************************************* //
