system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-6;
        relTol          0.01;
        smoother        GaussSeidel;
    }

    pcorr
    {
        solver          GAMG;
        tolerance       1e-6;
        relTol          0.01;
        smoother        GaussSeidel;	
    }	

    pFinal
    {
        $p;
        relTol          0;
    }

    pcorrFinal
    {
        $p;
        relTol          0;
    }

    U.air
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

    U.airFinal
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }

    kinematicCloud:alpha
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }

    "cellDisplacement.*"
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 200; //sqrt(meshSize)
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors     2;
    momentumPredictor yes;
    nNonOrthogonalCorrectors 3;
    pRefCell        0;
    pRefValue       0;
    pMinFactor 	    0.8;
    pMaxFactor	    1.1;
    checkMeshCourantNo  no;
    correctPhi          no;
}

relaxationFactors
{
    fields
    {
        "p.*"           0.1;
	"(.*)Final"	0.9;
      }
    equations
    {
        "U.*"           0.4;
	"(.*)Final"	0.9;
    }
}





// ************************************************************************* //
